### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/1fbbb0df-e422-4b4b-b065-b78b2dd15a2d/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-3ba96643.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/About-3ba96643.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e38d4328.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ArticleLayouts-e38d4328.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4ed255e1.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-4ed255e1.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-e7f47360.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-e7f47360.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-129c029a.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-129c029a.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-991941bf.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Start-991941bf.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-f59d2d27.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartNav-f59d2d27.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-be4ea729.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/app-be4ea729.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-b1e87f1f.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index.es-b1e87f1f.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-c9a7c047.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/jquery.easing-c9a7c047.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "6f44660556ddd53dc5f6e0ac850dc2bc" -> "5d0de8c133e87af8da6008af61f8b892"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      ~ source_hash            = "9d36fced006090c98d2f60346bc0ce8b" -> "eae7a357e689d9f55cb0dbc5c94cc96e"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      ~ source_hash            = "1eb2d3a29786c6e04c6486a432103cd5" -> "d5b673b2e315d50a1dbe191368a6a877"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      ~ source_hash            = "9eda5db27ec59fdf28c2410c57672fb4" -> "06de9c5a6be55a62e53854c216b9be60"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-3ba96643.js"] will be destroyed
  # (because key ["assets/About-3ba96643.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "9660c17174819ae6370b6a81cbde7ae8" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-3ba96643.js" -> null
      - key                    = "assets/About-3ba96643.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-3ba96643.js" -> null
      - source_hash            = "9660c17174819ae6370b6a81cbde7ae8" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-b2b111e4.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-b2b111e4.js"
      + source_hash            = "5b050c5a9c0fe3a6d744add87b32933e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-e0442dce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-e0442dce.js"
      + source_hash            = "f79258d463f0146248630258a319c2bc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e38d4328.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-e38d4328.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "14502766ffff0341ecb5c3a2bf43a52d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-e38d4328.js" -> null
      - key                    = "assets/ArticleLayouts-e38d4328.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-e38d4328.js" -> null
      - source_hash            = "14502766ffff0341ecb5c3a2bf43a52d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4ed255e1.js"] will be destroyed
  # (because key ["assets/Articles-4ed255e1.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ef10a60632f2d2025109f17a07ebd609" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-4ed255e1.js" -> null
      - key                    = "assets/Articles-4ed255e1.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-4ed255e1.js" -> null
      - source_hash            = "ef10a60632f2d2025109f17a07ebd609" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-4f38065c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-4f38065c.js"
      + source_hash            = "ed3e79b559681bde95283db2cdb5f4ff"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-e7f47360.js"] will be destroyed
  # (because key ["assets/Landing-e7f47360.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "1bde4d78037a7906d55ad2ba510da9ba" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-e7f47360.js" -> null
      - key                    = "assets/Landing-e7f47360.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-e7f47360.js" -> null
      - source_hash            = "1bde4d78037a7906d55ad2ba510da9ba" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-eaf6275a.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-eaf6275a.js"
      + source_hash            = "e17e97f9b0ae2ce2333c4a421f1de774"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-129c029a.js"] will be destroyed
  # (because key ["assets/PDF-129c029a.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "bef2070070b3c92751c8d60a0ba6e8b7" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-129c029a.js" -> null
      - key                    = "assets/PDF-129c029a.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-129c029a.js" -> null
      - source_hash            = "bef2070070b3c92751c8d60a0ba6e8b7" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-8e379427.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-8e379427.js"
      + source_hash            = "7d1efdf8e797dfe032364614f37ba7a2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-991941bf.js"] will be destroyed
  # (because key ["assets/Start-991941bf.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "c5a8afa4aab2b9580cd1fff6aee86d12" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-991941bf.js" -> null
      - key                    = "assets/Start-991941bf.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-991941bf.js" -> null
      - source_hash            = "c5a8afa4aab2b9580cd1fff6aee86d12" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-b54dfad9.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-b54dfad9.js"
      + source_hash            = "6c874cdc7f0d1f41b3c05c07c0e0abe0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-139e3675.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-139e3675.js"
      + source_hash            = "5e97c7e0708883d62d42891789274ae3"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-f59d2d27.js"] will be destroyed
  # (because key ["assets/StartNav-f59d2d27.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6bb1f90b34404a8fe504344d49f52555" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartNav-f59d2d27.js" -> null
      - key                    = "assets/StartNav-f59d2d27.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartNav-f59d2d27.js" -> null
      - source_hash            = "6bb1f90b34404a8fe504344d49f52555" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-75e00e53.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-75e00e53.js"
      + source_hash            = "b94fc7c2524ff0b5f0b2ef40a6278a91"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-be4ea729.js"] will be destroyed
  # (because key ["assets/app-be4ea729.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "8fd09ed957ffa386226fbab3fa3028fa" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-be4ea729.js" -> null
      - key                    = "assets/app-be4ea729.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-be4ea729.js" -> null
      - source_hash            = "8fd09ed957ffa386226fbab3fa3028fa" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-49de4352.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-49de4352.js"
      + source_hash            = "cd575fc59030b6031b7a64f5239f4672"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-b1e87f1f.js"] will be destroyed
  # (because key ["assets/index.es-b1e87f1f.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "370cb46de09983ac305f8c9ca4fee271" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-b1e87f1f.js" -> null
      - key                    = "assets/index.es-b1e87f1f.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-b1e87f1f.js" -> null
      - source_hash            = "370cb46de09983ac305f8c9ca4fee271" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-1c7b97b0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-1c7b97b0.js"
      + source_hash            = "f3d9b4de10eee1a4926efb0f3b6f3318"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-c9a7c047.js"] will be destroyed
  # (because key ["assets/jquery.easing-c9a7c047.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "73f831a761537a8f5e5e8a14028e5516" -> null
      - force_destroy          = true -> null
      - id                     = "assets/jquery.easing-c9a7c047.js" -> null
      - key                    = "assets/jquery.easing-c9a7c047.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/jquery.easing-c9a7c047.js" -> null
      - source_hash            = "73f831a761537a8f5e5e8a14028e5516" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "4138c680c0d56504a3ebefa87f40b40f" -> "c9630bedb412a7dfa62318e11152c8ba"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      ~ source_hash            = "9dfe31a4fdf24121bb1bfc5a69a8bcc9" -> "17d481ce0b86a629598b805f00cdb9b3"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      ~ source_hash            = "33bec3661d301eb046859dcbe5e0bd80" -> "c9931a7d54ee78e9db3b4c8a3357d8e0"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "b754ae7c877f8633cf26f7bd3877fcd7" -> "cec9ac74eff3a92d4455aa2745af9455"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "aec4b0c74bc1f3718d3d7cbde96bd46c" -> "45660e3c355a528a33ca6c92ff93ad38"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 10 to add, 9 to change, 10 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        # (4 unchanged elements hidden)
        "9eda5db27ec59fdf28c2410c57672fb4",
      - "9660c17174819ae6370b6a81cbde7ae8",
      - "14502766ffff0341ecb5c3a2bf43a52d",
      - "ef10a60632f2d2025109f17a07ebd609",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "d254e9f4850a323e5ea30df3ac31964d",
        "4b4b60871b0c8cdca6fcf9d7e9188891",
      - "1bde4d78037a7906d55ad2ba510da9ba",
      - "bef2070070b3c92751c8d60a0ba6e8b7",
      + (known after apply),
      + (known after apply),
        "6fc87daab214fb58303b3d530c9b2001",
      - "c5a8afa4aab2b9580cd1fff6aee86d12",
      + (known after apply),
      + (known after apply),
        "35bc2af385e37e6def98966cb8b61301",
      - "6bb1f90b34404a8fe504344d49f52555",
      - "8fd09ed957ffa386226fbab3fa3028fa",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (16 unchanged elements hidden)
        "4936e3453a7e6bff7c1db8961e8c9697",
      - "370cb46de09983ac305f8c9ca4fee271",
      - "73f831a761537a8f5e5e8a14028e5516",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      - "assets/About-3ba96643.js",
      - "assets/ArticleLayouts-e38d4328.js",
      - "assets/Articles-4ed255e1.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/Articles-cdca7afd.css",
        "assets/Landing-61a40d7f.css",
      - "assets/Landing-e7f47360.js",
      - "assets/PDF-129c029a.js",
      + (known after apply),
      + (known after apply),
        "assets/PDF-ed9e0e67.css",
      - "assets/Start-991941bf.js",
      + (known after apply),
      + (known after apply),
        "assets/StartNav-cb1e6734.css",
      - "assets/StartNav-f59d2d27.js",
      - "assets/app-be4ea729.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (16 unchanged elements hidden)
        "assets/index-2883df99.css",
      - "assets/index.es-b1e87f1f.js",
      - "assets/jquery.easing-c9a7c047.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          ~ id  = "assets/About-3ba96643.js" -> (known after apply)
          ~ key = "assets/About-3ba96643.js" -> "assets/About-b2b111e4.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-e38d4328.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-e38d4328.js" -> "assets/ArticleLayouts-e0442dce.js"
        },
      ~ {
          ~ id  = "assets/Articles-4ed255e1.js" -> (known after apply)
          ~ key = "assets/Articles-4ed255e1.js" -> "assets/Articles-4f38065c.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
        {
            id  = "assets/Landing-61a40d7f.css"
            key = "assets/Landing-61a40d7f.css"
        },
      ~ {
          ~ id  = "assets/Landing-e7f47360.js" -> (known after apply)
          ~ key = "assets/Landing-e7f47360.js" -> "assets/Landing-eaf6275a.js"
        },
      ~ {
          ~ id  = "assets/PDF-129c029a.js" -> (known after apply)
          ~ key = "assets/PDF-129c029a.js" -> "assets/PDF-8e379427.js"
        },
        {
            id  = "assets/PDF-ed9e0e67.css"
            key = "assets/PDF-ed9e0e67.css"
        },
      ~ {
          ~ id  = "assets/Start-991941bf.js" -> (known after apply)
          ~ key = "assets/Start-991941bf.js" -> "assets/Start-b54dfad9.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/StartNav-139e3675.js"
        },
        {
            id  = "assets/StartNav-cb1e6734.css"
            key = "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/StartNav-f59d2d27.js" -> (known after apply)
          ~ key = "assets/StartNav-f59d2d27.js" -> "assets/app-75e00e53.js"
        },
      - {
          - id  = "assets/app-be4ea729.js"
          - key = "assets/app-be4ea729.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (16 unchanged elements hidden)
        {
            id  = "assets/index-2883df99.css"
            key = "assets/index-2883df99.css"
        },
      ~ {
          ~ id  = "assets/index.es-b1e87f1f.js" -> (known after apply)
          ~ key = "assets/index.es-b1e87f1f.js" -> "assets/index.es-49de4352.js"
        },
      ~ {
          ~ id  = "assets/jquery.easing-c9a7c047.js" -> (known after apply)
          ~ key = "assets/jquery.easing-c9a7c047.js" -> "assets/jquery.easing-1c7b97b0.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (16 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (5 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (3 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-en.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-es.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-3ba96643.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/About-3ba96643.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e38d4328.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ArticleLayouts-e38d4328.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4ed255e1.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-4ed255e1.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-e7f47360.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-e7f47360.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-129c029a.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-129c029a.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-991941bf.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-991941bf.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-f59d2d27.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartNav-f59d2d27.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-be4ea729.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/app-be4ea729.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-b1e87f1f.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index.es-b1e87f1f.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-c9a7c047.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/jquery.easing-c9a7c047.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "pdf.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "resume.html"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "sitemap.xml"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      ~ source_hash            = "6f44660556ddd53dc5f6e0ac850dc2bc" -> "5d0de8c133e87af8da6008af61f8b892"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles.html"%0A      ~ source_hash            = "9d36fced006090c98d2f60346bc0ce8b" -> "eae7a357e689d9f55cb0dbc5c94cc96e"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*